{"pages":[{"title":"关于","text":"关于博主博主是目前是一名在在校的计算机研究生（master student）,为未来而学习着，成长着。专业是计算机系统结构。目标是能够怀着求知与探索的品质，能够对社会有所贡献，在信息化浪潮中搏一番自己的精彩。 在此奉上牛顿的名言： 我好像是一个海边玩耍的孩子,不时为拾到比通常更光滑的石子或更美丽的贝壳而欢欣鼓舞,而展现在我面前的是完全未探明的真理之海。 关于博客博主搭建了这个博客主要是为了记录一些思考、经验、收藏和笔记。博客的内容可能倾向于记录博主的日常所学所思，当然也会有一些技术文章（技术文章博主主要写在CSDN上，这里放的少一些） 在此奉上查理芒格的名言： 如果要变得聪明，不停地问：为什么为什么为什么。 在此奉上高德纳（Donald Knuth，现代计算机鼻祖，《计算机程序设计艺术》作者）的名言： “让我们改变一下对构建程序的态度：不要把我们的主要工作想象为教计算机怎么做，相反，让我们集中精力向人们解释我们想让机器做什么。” 联系博主博客搭建了评论系统，直接用github授权评论即可，博主隔一段时间会看一下。","link":"/about/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/03/28/hello-world/"},{"title":"成为一个不惑、不忧、不惧的人","text":"说明:本文是梁启超于1922年应苏州学界邀请作的一场演讲。当时，他向在座者提出了一个问题：“为什么进学校？”。而后，他给出的答案是：进学校为的是求学问，求学问为的是学做人。而要成为一个人，总要具备三德：智、仁、勇，实现的状态便是“智者不惑，仁者不忧，勇者不惧”。演讲距今虽然已经过去快一个世纪，但是观点仍然具有很强的穿透力，值得大家好好读一读。 演讲全文诸君!我在南京讲学将近三个月了，这边苏州学界里，有好几回写信邀我，可惜我在南京是天天有功课的，不能分身前来。今天到这里，能够和全城各校诸君聚在一堂，令我感激的很，但有一件，还要请诸君原谅：因为我一个月以来，都带着些病，勉强支持，今天不能作很长的讲演，恐怕有负诸君期望哩。 问诸君“为什么进学校?” 我想人人都会众口一词的答道：“为的是求学问”。再问：“你为什么要求学问?”“你想学些什么?”恐怕各人的答案就很不相同，或者竟自答不出来了。诸君啊!我替你们回答一句罢：“为的是学做人。”你在学校里头学的什么数学、几何、物理、化学、生理、心理、历史、地理、国文、英语，乃至什么哲学、文学、科学、政治、法律、经济、教育、农业、工业、商业等等，不过是做人所需的一种手段，不能说专靠这些便达到做人的目的，任凭你把这些件件学的精通，你能够成个人不成个人还是个问题。 人类心理，有知、情、意三部分。这三部分圆满发达的状态，我们先哲名为三达德——智、仁、勇。为什么叫做“达德”呢?因为这三件事是人类普通道德的标准，总要三个具备，才能成一个人。三件的完成状态怎么样呢?孔子说：“知者不惑，仁者不忧，勇者不惧。”所以教育应分为知育、情育、意育三方面，——现在讲的智育、德育、体育不对，德育范围太笼统，体育范围太狭隘——知育要教到人不惑，情育要教到人不忧，意育到教到人不惧。教育家教育学生，应该以这三件为究竟，我们自动的自己教育自己，也应该以这三件为究竟。 1. 怎么样才能不惑呢?最要紧的是养成我们的判断力。想要养成判断力，第一步，最少须有相当的常识，进一步，对于自己要做的事须有专门智识，再进一步，还要有遇事能断的智慧。 假如一个人连常识都没有，听见打雷，说是雷公发威，看见月蚀，说是蛤蟆贪嘴。那么，一定闹到什么事都没有主意，碰到一点疑难问题，就靠求神问卜看相算命去解决，真所谓“大惑不解”，成了最可怜的人了。学校里小学中学所教，就是要人有了许多基本的知识，免得凡事都暗中摸索。 但仅仅有点常识还不够，我们做人，总要各有一件专门职业。这门职业，也并不是我一人破天荒去做，从前已经许多人做过，他们积累了无数经验，发现出好些原理原则，这就是专门学识。我打算做这项职业，就应该有这项专门的学识。例如我想做农吗，怎么的改良土壤，怎么的改良种子，怎么的防御水旱病虫，等等，都是前人经验有得成为学识的;我们有了这种学识，应用他来处置这些事，自然会不惑，反是则惑了。做工、做商等等都各有他的专门学识，也是如此。我想做财政家吗，何种租税可以生出何样结果，何种公债可以生出何样结果等等，都是前人经验有得成为学识的;我们有了这种学识，应用他来处置这些事，自然会不惑，反是则惑了。教育家、军事家等等，都各有他的专门学说，也是如此。 我们在高等以上学校所求的知识，就是这一类。但专靠这种常识和学识就够吗?还不能。宇宙和人生是活的不是呆的，我们每日碰见的事理是复杂的变化的，不是单纯的刻板的，倘若我们只是学过这一件，才懂这一件，那么，碰着一件没有学过的事来到跟前，便手忙脚乱了。 所以还要养成总体的智慧，才能有根本的判断力。这种总的智慧如何才能养成呢?第一件，要把我们向来粗浮的脑筋着实磨炼他，叫他变成细密而且踏实。那么，无论遇着如何繁难的事，我都可以彻头彻尾想清楚他的条理，自然不至于惑了。 第二件，要把我们向来浑浊的脑筋，着实将养他，叫他变成清明。那么，一件事理到跟前，我才能很从容很莹澈的去判断他，自然不至于惑了。以上所说常识学识和总体的智慧，都是知育的要件，目的是教人做到“知者不惑”。 2. 怎么样才能不忧呢?为什么仁者便会不忧呢?想明白这个道理，先要知道中国先哲的人生观是怎么样。“仁”之一字，儒家人生观的全体大用都包在里头。“仁”到底是什么?很难用言语说明，勉强下个解释，可以说是：“普遍人格之实现。”孔子说：“仁者人也。”意思是说人格完成就叫做“仁”。 但我们要知道，人格不是单独一个人可以表现的，要从人和人的关系上来看。所以仁字从二人，郑康成解他做“相人偶”。总而言之，要彼此交感互发，成为一体，然后我的人格才能实现。所以我们若不讲人格主义，那便无话可说;讲到这个主义，当然归宿到普遍人格。换句话说，宇宙即是人生，人生即是宇宙，我们的人格，和宇宙无二区别，体验得这个道理，就叫做“仁者”。然则这种仁者为什么就会不忧呢?大凡忧之所从来，不外两端，一曰忧成败，二曰忧得失。我们得着“仁”的人生观，就不会忧成败。为什么呢?因为我们知道宇宙和人生是永远不会圆满的，所以《易经》六十四卦，始“乾”而终“未济”。正为在这永远不会圆满的宇宙中，才永远容得我们创造进化。 我们所做的事，不过在宇宙进化几万万里的长途中，往前挪一寸，两寸，那里配说成功呢?然则不做怎么样呢?不做便连这一寸都不往前挪，那可真是失败了。 “仁者”看透这种道理，信得过只有不做事才算失败，肯做事便不会失败。所以《易经》说：“君子以自强不息。”换一方面来看，他们又信得过凡事不会成功的几万万里路挪了一两寸，算成功吗?所以《论语》：“知其不可而为之。”你想，有这种人生观的人，还有什么成败可忧呢? 再者，我们得着“仁”的人生观，便不会忧得失。为什么呢?因为认定这件东西是我的，才有得失之可言。连人格都不是单独存在，不能明确的画出这一部分是我的，那一部分是人家的，然则哪里有东西可以为我们所得?既已没有东西为我所得，当然也没有东西为我所失。 我只是为学问而学问，为劳动而劳动，并不是拿学问劳动等做手段来达某种目的——可以为我们“所得”得。所以老子说：“生而不有，为而不恃。”“既以为人已愈有，既以与人已愈多。”你想，有这种人生观的人，还有什么得失可忧呢?总而言之，有了这种人生观，自然会觉得“天地与我并生，而万物与我为一”，自然会“无人而不自得”。他的生活，纯然是趣味化艺术化。这是最高的情感教育，目的教人做到“仁者不忧”。 3. 怎么样才能不惧呢?有了不惑不忧功夫，惧当然会减少许多了。但这是属于意志方面的事。一个人若是意志力薄弱，便会有丰富的智识，临时也会用不着，便有优美的情操，临时也会变了卦。然则意志怎么会才坚强呢?头一件须要心地光明，孟子说：“浩然之气，至大至刚。行有不慊于心，则馁矣。”又说：“自反而不缩，虽褐宽博，吾不惴焉;自反而缩，虽千万人，吾往矣。” 俗话说得好：“生平不作亏心事，夜半敲门心不惊。”一个人要保持勇气，须要从一切行为可以公开做起，这是第一着。第二件要不为劣等欲望之所牵制。 《论语》记：子曰：“吾未见刚者。”或对曰伸枨。子曰：“枨也欲，焉刚。”一被物质上无聊得嗜欲东拉西扯，那么百炼成刚也会变成绕指柔了。总之，一个人的意志，由刚强变为薄弱极易，由薄弱返到刚强极难。一个人有了意志薄弱的毛病，这个人可就完了。 自己作不起自己的主，还有什么事可做?受别人压制，做别人奴隶，自己只要肯奋斗，终必能恢复自由。自己的意志做了自己情欲的奴隶，那么，真是万劫沉沦，永无恢复自由的余地，终身畏首畏尾，成了个可怜人了。 孔子说：“和而不流，强哉矫;中立而不倚，强哉矫。国有道，不变塞焉，强哉矫;国无道，至死不变，强哉矫。”我老实告诉诸君说罢，做人不做到如此，决不会成一个人。但做到如此真是不容易，非时时刻刻做磨炼意志的功夫不可，意志磨炼得到家，自然是看着自己应做得事，一点不迟疑，扛起来便做，“虽千万人吾往矣。”这样才算顶天立地做一世人，绝不会有藏头躲尾左支右绌的丑态。这便是意育的目的，要教人做到“勇者不惧”。 我们拿这三件事作做人的标准，请诸君想想，我自己现时做到哪一件——哪一件稍微有一点把握。倘若连一件都不能做到，连一点把握都没有，嗳哟!那可真危险了，你将来做人恐怕做不成。讲到学校里的教育吗，第二层的情育，第三层的意育，可以说完全没有，剩下的只有第一层的知育。就算知育罢，又只有所谓常识和学识，至于我所讲的总体智慧靠来养成根本判断力的，却是一点儿也没有。 这种“贩卖知识杂货店”的育，把他前途想下去，真令人不寒而栗!现在这种教育，一时又改革不来，我们可爱的青年，除了他更没有可以受教育的地方。诸君啊!你到底还要做人不要?你要知道危险呀，非你自己抖擞精神方法自救，没有人救你呀! 诸君啊!你千万别要以为得些断片的智识，就算是有学问呀。我老实不客气告诉你罢;你如果做成一个人，知识自然是越多越好：你如果做不成一个人，知识却是越多越坏。你不信吗?试想想全国人所唾骂的卖国贼某人某人，是有智识的呀，还是没有智识的呢?试想想全国人所痛恨的官僚政客——专门助军阀作恶鱼肉良民的人，是有智识的呀，还是没有智识的呢?诸君须知道啊，这些人当十几年前在学校的时代，意气横历，天真烂漫，何尝不和诸君一样?为什么就会堕落到这样的田地呀? 屈原说：“何昔日之芳草兮，今直为此萧艾也!岂其有他故兮，莫好修之害也。”天下最伤心的事，莫过于看着一群好好的青年，一步一步的往坏路上走。诸君猛醒啊!现在你所厌所恨的人，就是你前车之鉴了。 诸君啊!你现在怀疑吗?沉闷吗?悲哀痛苦吗?觉得外边的压迫你不能抵抗吗?我告诉你：你怀疑和沉闷，便是你因不知才会惑;你悲哀痛苦，便是你因不仁才会忧;你觉得你不能抵抗外界的压迫，便是你因不勇才有惧。这都是你的知、情、意未经过修养磨炼，所以还未成个人。我盼望你有痛切的自觉啊!有了自觉，自然会成功。那么，学校之外，当然有许多学问，读一卷经，翻一不史，到处都可以发现诸君的良师呀! 诸君啊，醒醒罢!养足你的根本智慧，体验出你的人格人生观，保护好你的自由意志。你成人不成人，就看这几年哩!","link":"/2020/03/29/%E6%88%90%E4%B8%BA%E4%B8%80%E4%B8%AA%E4%B8%8D%E6%83%91%E3%80%81%E4%B8%8D%E5%BF%A7%E3%80%81%E4%B8%8D%E6%83%A7%E7%9A%84%E4%BA%BA/"},{"title":"《苏菲的世界》读书笔记","text":"伊甸园 在某个时刻事物必然从无到有你是谁？世界从何处来？ 要么一直存在 要么从无到有 比如空间是由某样东西变成的，那么那样东西必然也是由另外一样东西变成的。一直推下去，那么必然是在某一时刻，事物从无到有。 生死这两件事就像钱币的两面，被我们的思考翻来翻去的时候，当一面变得更清晰的时候，另外一面也随之变得更大而清晰。 魔术师的礼帽 要成为一个优秀的哲学家只有一个条件：要有好奇心哲学是什么？天底下有没有一种东西是所有人都感兴趣的呢？有的！当人的基本需求（比如衣食住行，亲情爱情，爱与关怀等）满足之后，还有一些东西是人人都需要的，那就是明白我们是谁，我们为何在这里。宇宙，地球与生命是如何产生的？ 探讨哲学的最好方式就是问一些哲学性的问题，如：这世界是如何创造出来的？其背后是否有某种一直或者意义？人死后还有生命吗？我们如何能够解答这些问题呢？最重要的是，我们应该如何生活？我们无法从百科全书上得到这些答案，不过读一读别人的意见倒可以帮助我们建立自己对于生命的看法。 哲学家追求真理的过程很想一步侦探小说，对于案件，警方有时候可以侦破，但也有可能永远无法查出真相（虽然在某个地方一定有一个破案的办法）。因此，即使要回答一个问题很不容易，但无论如何总会有一个（且仅此一个）正确答案的。比如人死后要么就是透过某种形式存在，要不就是根本不在存在。 作者很好的比喻：许多人对于这个世界的种种也同样有种不可置信的感觉，就像我们看到魔术师突然从一顶原本空空如也的帽子里拉出一只小兔子一般。实际上我们就生活在这个世界上，是这个世界的一部分。形象的比喻一下，我们就是那只从礼帽里面变出的小兔子的一部分，小兔子可以比作是是整个宇宙，而我们则是寄居在小兔子身上的小小生物，但是我们和兔子不同的是，小兔子可不知道自己参与了一场魔术表演，而我们知道自己是某种神秘事物的一部分，我们想了解其中的奥秘；哲学家们总是试图沿着兔子的细毛往上爬，以便将魔术师的看个清楚； 神话 善与恶之间脆弱的平衡神话的世界观 北欧 （挪威）索尔和铁锤 北欧人相信人类居住的这部分是一部分岛屿，名为米德加德(Midgard)，也就是”中央王国“的意思，在这个中央王国内，有一个地方名叫阿斯加德（Asgard），乃是诸神的领地。中央王国之外，有一个叫乌特加德（Utgard），是狡猾的巨人居住的地方。 象征肥沃多产的额女神芙瑞雅 侍童洛奇 《史莱慕之诗》 巨人之王史莱慕希腊 公元前700左右，有一大部分希腊神话被荷马与赫西俄德（赫西俄德Hesiod以长诗《工作与时日》《神谱》闻名于后世，被称为“希腊训谕诗之父”。）记录下来。 赞诺芬尼司(Xnphans),古希腊哲学家。是早期批评荷马的神话的哲学家之一。 赞诺芬尼斯_百度百科 他指出人类按照自己的形象创造出这些天神。 随后这段期间，希腊人在希腊本土与意大利南部，小亚细亚等希腊殖民地建立了许多城市。在这些城市中，所有劳力工作由奴隶担任，因此市民有充分的闲暇，可以将所有的时间投注在政治与文化上；这时候的人们思考方式与以前大不相同，无需借助神话而提出一些哲学性的问题；我们称这样的现象为“从神话的思考模式发展到以经验与理性为基础的思考模式” 自然派哲学家 没有一件事物可以来自空无万事万物是否有一种基本的物质组成？哲学家的课题：每个人关注和质疑的事项是什么？了解了每一位哲学家的课题之后，我们就比较容易了解他的思想脉络，因为没有任何一位哲学家会企图探讨哲学的所有领域。 自然派哲学家关注的课题是“大自然与它的循环和变化”最重要的是，他们想要透过对大自然本身的研究来了解实际的变化过程，而不是借助神话来解释。这样，哲学逐渐脱离了宗教的范畴。自然派哲学家朝科学推理的方向迈出了第一步，成为后来科学的先驱。 米雷特斯的三位哲学家泰利斯安娜克西曼德安那西梅尼斯 没有任何事物会来自于虚无帕梅尼德斯（约公元前540年~公元前480年）他认为： 没有任何事物会改变。 因此我们的感官认知是不可靠的 理性主义：坚决相信人的理智的态度理性主义者：百分百相信人类的理智是时间所有知识源泉的人 所有的事物都是流动的赫拉克里德斯（约公元前540年~公元前480年）他认为： 万物都会改变（”一切事物都是流动的“） 我们的感官认知是可靠的 恩培窦克里斯（西西里）恩培窦克里斯认为帕梅尼德斯与赫拉克里德斯各有一点是对的，也各有一点是错的，造成这个根本性差异的原因是之前的两人都认定世间只有一种元素存在。恩培窦克里斯认为： 没有任何事物会改变。 我们的感官认知是可靠的 恩培窦克里斯的结论是：大自然不可能只有一种元素构成。 安纳萨格拉斯（约公元前500年~公元前428年） 德谟克里特斯 世界上最巧妙的玩具 积木为何是世界上最巧妙的玩具？ 原子理论德谟克里特斯（约公元前460年~公元前370年，来自爱琴海北部海岸的阿布拉德小镇） 唯物论者：只相信物质的东西。 命运 算命者试图预测某些事实上极不可测的事物古希腊的德尔菲（Delphi）神论与宿命论 现在看来都是迷信 历史与医学历史上最早的一批历史学家开始为历史事件寻求合理的解释。贺若多陀斯（约公元前484年~公元前424年）与修西德底斯（约公元前460年~公元前400年） 在希腊哲学、历史学发展的同时，希腊医学兴起，其目的是为了疾病与健康寻求合乎自然的解释。希波克拉底（约公元前460~公元前377年，生于寇斯岛，希腊医学始祖）比较出名的是希波克拉底誓言： 我将依照自身的能力与判断，采用对病人有利的疗法与处方，绝不施以有害或有毒之物。无论应何人之请，我也绝不给与致命药物或做此类之建议，也绝不协助妇女堕胎。进入病家访视时，我将以病人的福祉为念，不做任何贪渎害人之事，不受男女奴仆之引诱。我在执业时之所见所闻，反不应泄露者，我将严予保密。若我遵行此一誓言，不懈不怠，愿上苍使我乐享生命、精进医事并受世人敬重。若我违反誓言，愿我遭相反之命运。 苏格拉底 最聪明的是明白自己无知的人 是否有人天生就很害羞呢？最聪明的是明白自己无知的人。真正的智慧来自内心。明白是非者必能够进退合宜。 雅典的哲学以人为中心苏格拉底是谁？谈话的艺术 “苏格拉底式的反讽”神圣的声音雅典的小丑正确的见解导致正确的行动 雅典 废墟中升起了几栋高楼柏拉图 回归灵魂世界的渴望柏拉图学院永远的真善美理型的世界真正的知识不朽的灵魂走出黑暗的洞穴（洞穴神话）哲学之国（理想国） 少校的小木屋 镜中的女孩双眼眨了一眨亚力士多德 一位希望澄清我们观念的严谨的逻辑学家逻辑亚里士多德创立了逻辑学这门学科，他以实例显示我们在得出合乎逻辑的结论或证明时，必须遵循若干法则。 希腊文化 一丝火花生命与容忍的哲学宗教，哲学与科学 犬儒学派 斯多葛学派 伊比鸠鲁学派 新柏拉图派哲学神秘主义 明信片 我对自己实施严格的检查制度两种文化 避免在真空中飘浮的唯一方式印欧文化 闪族文化 中世纪 对了一部分并不等于错文艺复兴 啊！藏在凡俗身躯里的神明子孙哪实证法：以亲身的经验，而不是以古人的著作或凭空想象来作为知识的基础。 巴洛克时期 宛如梦中的事物笛卡尔 他希望清除工地上所有的瓦砾斯宾诺莎 上帝不是一个傀儡戏师傅洛克 赤裸、空虚一如教师来到教室前的黑板休姆 将它付之一炬如果我们手里有一本书，我们应该问：书里是否有包含任何与数量和数目有关的抽象思考？如果答案是没有，那么我们应该再问：书里是否包含任何与事实有关的经验性思考？如果答案是没有，那么我们还是将它付之一炬吧，因为这样的书纯粹是诡辩和幻想。 印象观念 不可知论者：不持肯定或否定的态度，持怀疑态度。 柏克莱 宛如燃烧的恒星旁一颗晕眩的行星柏客来 曾祖母向一名吉普赛妇人买的一面古老魔镜启蒙 从制针的技术到铸造大炮的方法康德 头上闪烁的星空与心中的道德规范浪漫主义 神秘之路通向内心黑格尔 可以站得住脚的就是有道理的祁克果 欧洲正迈向破产的地步主观的真理可以测算的真理我信因为荒谬个体主义者 马克思 在欧洲游荡的幽灵达尔文 满载基因航行过生命的一艘小船弗洛伊德 他内心出现那股令人讨厌的自大的冲动弗洛伊德发展了所谓的深度心理学或精神分析弗洛依德主张人和他的环境之间不断有一种紧张关系存在。这种紧张关系（也就是冲突）尤其存在于他的驱策力，需要和社会之间。基本需求可能会被伪装和升华；快乐原则/本我现实原则/自我这世界的道德规范已经成为我们内心的一部分/成为超我潜意识:我们并不一定能够意识到我们曾经有过的各种经验。但那些只要我们“用心想便可以记起来的想法或经验”通常是指被压抑的想法或经验。不错的比喻：演讲厅说话演讲厅称为”意识“，演讲厅之外称为“潜意识”；大声喧哗者被”压抑“，椅子堵住门口作为”防御“ 我们的感觉和行为会受到“潜意识的鼓动”这类机制有好几种：比如“说溜了嘴”“合理化”我们自己也不愿意承认，也不愿意告诉别人我们做一件事的真正动机，因为这个动机是让人无法接受的。–&gt;”两面式沟通“的经验“投射”把我们内心试图压抑的特点转移到别人身上。譬如说一个很吝啬的人会说别人斤斤计较。如何对抗不愉快的经历呢？弗洛伊德发展出一个”自由联想“的技巧。梦的解析显梦 mainfest dream 潜梦意念把潜梦意念转换成显梦面向的工作，他称之为“梦的运作”超现实主义 灵感：潜意识的盖子被打开了，好像我们突然所想的东西是来自某种外部的源泉似的。创作的过程是想象与理性细密交织的时刻 想象力也许可以创造新的事物，但是却不能加以挑选，这时候理智就发挥作用了！ 我们这个时代 人是注定要受自由之苦的花园宴会 一只白色的乌鸦对位法 两首或多首旋律齐响那轰然一响 我们也是星尘","link":"/2020/03/29/%E3%80%8A%E8%8B%8F%E8%8F%B2%E7%9A%84%E4%B8%96%E7%95%8C%E3%80%8B%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"},{"title":"好用的chrome插件","text":"深刻体会到工具的好用，有一些问题使用工具真的省力，关键是学会如何找到这些工具和如何描述自己的相关需求。 Awesome Autocomplete for GitHub增强github的搜索功能 Git History Browser Extension查看github的历史更新记录，超级好用，可以对比不同人对代码做的更新； octotree可以查看github的目录结构，并且下载单个的文件； Sourcegraph可以查看相关的代码，搜索代码，查找代码定义的地方 The Great Suspender休眠chrome不必要的标签页 Tab Resize - split screen layouts浏览器分屏 本文许可证本文遵循 CC BY-NC-SA 4.0（署名 - 非商业性使用 - 相同方式共享） 协议，转载请注明出处，不得用于商业目的。","link":"/2020/03/29/%E5%A5%BD%E7%94%A8%E7%9A%84chrome%E6%8F%92%E4%BB%B6/"},{"title":"学术论文的基本结构","text":"基本结构 标题 真实反应论文内容 简短明了 吸引人 大背景 小背景 技术特色 摘要 概括你的研究 假设或要研究的问题 研究方法 主要成果 引言 说明选题的背景，目的，意义 陈述研究的主要内容和论文的假说或研究问题 文章的研究方法与章节编排 文献综述 阐述前人的研究，展示文献批判能力，说明你对研究问题的掌握程度，表明你研究的创新之处。 研究方法 详细介绍相关信息，便于读者采取同样的方法能够重复此项研究。 研究性质 对象 步骤 工具 条件 … 研究结果 用文字和/或图表真实报告你获得的数据或结果。 讨论 基于你获得的数据论述对于研究问题可能得到的结论。 结论 简明总结所得到的数据，得出的结论及意义。 说明研究的价值，不足或局限性。 致谢 参考文献 本文许可证本文遵循 CC BY-NC-SA 4.0（署名 - 非商业性使用 - 相同方式共享） 协议，转载请注明出处，不得用于商业目的。","link":"/2020/03/29/%E5%AD%A6%E6%9C%AF%E8%AE%BA%E6%96%87%E7%9A%84%E5%9F%BA%E6%9C%AC%E7%BB%93%E6%9E%84/"},{"title":"《练习的心态》读书笔记","text":"引言 人生就是漫长的练习第1章 学习开始当你弄懂了练习的正确原理，学习某些新事物的任务将变成一种没有压力的愉快与平和的体验，变成一个适合你生活中各种领域的过程，并且促成你对生活中所有的艰辛与痛苦采用合适的视角来观察。 压力与焦虑主要来源于我们自己对目标的依恋。练习的心态这也是一种技能：尽可能迅速，最少的付出来发展任何一项技能的能力，以及在这个过程体验内心平和与愉悦的能力。 在不感到失败和焦虑的情况下去努力实现目标。学习的渴望仅仅是第一步，需要正确理解技术性细节与努力，否则会耗尽的 当今的文化是多任务的，比如开车时第一件事会习惯性打开收音机。 而滑冰正相反，滑冰时候不会注意边上嘈杂的声音！由于习惯于一心多用，我们大脑躁动不安，且具有极大惯性，没法安静下来。 练习的心态是安静的意识是第一位的：没法控制自己的思维，不管设立什么样的目标，都没有用。我们对自己要去的方向就像乘坐马车，必须要拉紧思维的缰绳才行啊！填补空虚是一个循环往复的过程 学会走路的过程并不会在心里让你压力倍增。我们要意识并掌控这个过程，学会从中享受！ 第2章 以过程为导向，不以结果为导向 人生的悖论：耐心与自律的问题是，要培养它们中的任何一个，需要同时具备它们两个。 简单法则 以过程为导向 重点关注当前 将过程确定为目标，并且运用总目标作为船舵，以指引自己的努力。 对自己想要做的事情刻意训练，带着意图训练，并且自始至终清醒的知道那种意图 第3章 关键是视角当我们试图理解自己以及我们对人生中各种努力的痛苦挣扎时，可以通过观察一朵鲜花来找到平和。问你自己：一朵鲜花的生命，从撒下种子到完全盛开，在什么时候可以达到完美？ 然后呢？ 达成目标之后，然后呢？然后又能干什么呢？？？？初学者心态鲜花的生命，自始至终都是完美的 他了解到，假如将自己的思绪集中在当前，并只专注了他在这一刻正在做的事情的过程，那便可以喜欢上他正在做的任何事情。 第4章 培养期望的习惯习惯是学来的。明智地选择它们。自己创造想要的习惯，不带情绪和判断的采取哪些行为，之后坚持下去。 就像一名优秀的老师，对待学生的错误不会情绪化，那种情绪化来源于自我期望，与结果和产物关联，如果你体验到这些情绪，就证明你没有专注于当前过程！！！ 怎么样阻止旧的习惯，采用一种例行行为来阻止，比如击球前例动作 第5章 感知变化，创造耐心！你需要的所有耐心，都已经处在你的内心了。知道什么时候内心疯狂奔走接受什么事情不会尽善尽美 放弃某种幸福和乐趣就在某个地方的徒劳想法 在探索的道路上，除了去追求，没有别的可以达到的目标了//我们20岁的目标肯定与18岁的不同，参照对象也是不一样的，不要指望能达到你的目标。探索本身就是一种目标。 对于没有费力得到的东西，那种兴奋感在得到东西早已烟消云散。 得到目标和实现目标是两种完全不同的概念真正的愉悦 第6章 4“S”方法力求简化，将征服大多数复杂的任务。 简化 细分 缩短 放慢 第7章 平静与DOC方法客观是通往宁静心灵之路！ 主观判断需要一个评估和对比的过程，这要求有一个相对的点，即理想状况判断有一个不利的地方，它不会以一种超然的方式运行，常常会包含着某些情绪，有趣的是，对事情我们感觉到的重要性越多，我们带的情绪越多将自我与观察者合并 。就像我们安慰他人时候带着的超然智慧一样。 怎么合并呢 冥想！ do observe correct就像射箭运动员一样，安静，不复杂完全没有心理的杂乱 第8章 教孩子，也从孩子身上学习智慧并不是年龄的副产物。从你身边所有的人身上学习，同时也用自己的行为影响身边的人。 第9章 你的技能在成长有了刻意的和反复的努力，进步便水到渠成。 如果说各种软件上的信息不能使你知识变得丰富，那么你就不需要它们 本文许可证本文遵循 CC BY-NC-SA 4.0（署名 - 非商业性使用 - 相同方式共享） 协议，转载请注明出处，不得用于商业目的。","link":"/2020/04/08/%E3%80%8A%E7%BB%83%E4%B9%A0%E7%9A%84%E5%BF%83%E6%80%81%E3%80%8B%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"},{"title":"linux 性能分析，测试与调优工具","text":"静态性能分析工具(static performance analysis tools) dmesg 用于显示开机信息，开机信息也保存在/var/log目录中，名为dmesg的文件里。 blockdev 工具允许从命令行调用区块设备控制程序。调用设备的ioctl函数。似乎Linux中对设备的直接操作只有ioctl函数。 ldd （List Dynamic Dependencies，意译为列出动态库依赖关系）是一款在类Unix系统的实用工具，负责在命令行内输出程序或共享库所依赖的函数库。 lsblk (list block)即用于列出所有可用块设备的信息,而且还能显示他们之间的依赖关系,但是它不会列出RAM盘的信息 lsscsi 可以看到Raid卡信息和所有虚拟磁盘以及光驱的信息，如果没有硬件SCSI控制器，那就不会返回信息。 lspci 显示有关pci总线的信息以及连接到它们的设备。 lscpu (list cpu)显示CPU的详细信息，比如CPU的制造商、架构、CPU数量、型号、主频、缓存及支持的虚拟化技术等信息。 lstopo (list topology of the system)显示可视化的方式组成 CPU、缓存、内存和I/O设备的拓扑结构。这个命令用来识别处理器结构和系统的NUMA拓扑结构。 likwid (Like I Knew What I’m Doing) 是一个用来测量、配置并显示硬件相关特性的命令行收集工具。其中的likwid拓扑结构能显示CPU硬件(线程/缓存/NUMA)的拓扑结构信息，还能识别处理器家族(比如：Intel Core 2, AMD Shanghai)。 smartctl 查看硬盘的SMART信息。 fdisk 创建和维护分区表的程序(兼容DOS类型的分区表、BSD或SUN的磁盘列表） schedtool (scheduling tool)查询或设置CPU状态的工具。通过不同的参数可以查看或设置不同的属性。 numactl (Control NUMA policy)用于控制 进程与共享存储的 NUMA 技术机制。 cpuid 获取CPU的信息。该命令的底层是CPUID指令。它获取的内容比/proc/cpuinfo要详细很多。 MegaCli 管理维护硬件RAID的软件 App Config 观测工具(Observability Tools) iostat (input/output statistics)报告中央处理器（CPU）统计信息和整个系统、适配器、tty 设备、磁盘和 CD-ROM 的输入/输出统计信息。 vmstat (VirtualMeomoryStatistics,虚拟内存统计) 报告关于内核线程、虚拟内存、磁盘、陷阱和 CPU 活动的统计信息。 dstat 用来替换vmstat、iostat、netstat、nfsstat和ifstat这些命令的工具,是一个全能系统信息统计工具。 pidstat 是sysstat工具的一个命令，用于监控全部或指定进程的cpu、内存、线程、设备IO等系统资源的占用情况。 mpstat (multiprocessor statistics)查看多核心的cpu中每个计算核心的统计数据。类似工具vmstat只能查看系统的整体cpu情况 netstat ( network statistics)显示当前的网络状态，包括传输控制协议层的连线状况、路由表、网络接口状态和网络协议的统计信息等。 iotop 用来监视磁盘I/O使用状况的top类工具 top (display Linux processes)实时显示系统中各个进程的资源占用状况,类似于Windows的任务管理器。 htop top命令的升级版。交互式的进程浏览器，可以用来替换Linux下的top命令 gtop JavaScript 编写的开源系统资源监控实用程序,它是 Linux 系统自带 top 工具的替代品 tiptop 通过读取CPU硬件计数器的信息（比如cahche miss，executed instructions per cycle等等）了解程序执行效率 strace 可跟踪系统调用的执行。最简单的方式，它可以从头到尾跟踪binary的执行，然后以一行文本输出系统调用的名字，参数和返回值。 uptime 可以显示当前系统时间、系统已运行时间、启用终端数量以及平均负载值等信息 lsof (list open files)列出当前系统打开的文件，注意linux中设备也是文件 perf 性能分析工具，能够进行函数级与指令级的热点查找。 Flame Graphs 性能分析的利器,通过它可以快速定位性能瓶颈点。 测试工具(Benchmarking Tools) fio 开源的I/O压力测试工具，主要是用来测试磁盘/SSD的IO性能，也可测试cpu，nic的IO性能。 hdparm (hard disk parameters)用于显示与设定硬盘的参数 dd 用于读取、转换并输出数据。可从标准输入或文件中读取数据,根据指定的格式来转换数据,再输出到文件、设备或标准输出。 perf_events 网上很多叫法如perf_events , perf profiler , Performance Counters for Linux。叫法不同，都指perf perf-tools 基于 perf_events (perf) 和 ftrace 的Linux性能分析调优工具集，能够收集ftrace和perf_events中乱七八糟的参数。 ktap Linux的基于脚本的动态跟踪工具 允许用户跟踪Linux内核动态。 sysbench 一个开源的、模块化的、跨平台的多线程性能测试工具,可以用来进行CPU、内存、磁盘I/O、线程、数据库的性能测试。 ab (apachebench) ab命令会创建多个并发访问线程,模拟多个访问者同时对某一URL地址进行访问。 wrk 针对 Http 协议的基准测试工具，它能够在单机多核 CPU 的条件下，使用系统自带的高性能 I/O 机制，如 epoll，kqueue 等，通过多线程和事件模式，对目标机器产生大量的负载。 jmeter Apache组织开发的基于Java的压力测试工具。用于对软件做压力测试。 openssl 加解密能力也是CPU性能测试的一部分。 UnixBench 类unix系(Unix,BSD,Linux)统下的性能测试工具 lmbench 多平台软件，因此能够对同级别的系统进行比较测试，反映不同系统的优劣势，可用于评价系统综合性能的多平台开源benchmark，能够测试包括文档读写、内存操作、进程创建销毁开销、网络等性能. perfbench perf下的工具 测试系统性能 hping3 面向命令行的用于生成和解析TCP/IP协议数据包汇编/分析的开源工具。 iperf 网络性能测试工具。Iperf可以测试最大TCP和UDP带宽性能，具有多种参数和UDP特性，可以根据需要调整，可以报告带宽、延迟抖动和数据包丢失。 ping 向特定的目的主机发送 ICMP（Iternet Control Message Protocol 因特网报文控制协议）Echo 请求报文，测试目的站是否可达及了解其有关状态。 ttcp 传统的测试TCP性能的工具,它主要测试两个机器之间TCP的吞吐量(在应用层模拟消息传递的过程) traceroute 利用ICMP 协议定位您的计算机和目标计算机之间的所有路由器。 mtr 网络连通性判断工具，它结合了ping, traceroute,nslookup 的相关特性 pchar 沿Internet路径执行网络测量 调优工具(Tuning Tools) sysctl (System Administration)用来配置与显示在/proc/sys目录中的内核参数 swapon 用于激活Linux中的交换空间，Linux的内存管理必须使用交换区来建立虚拟内存。 env gnu的coreutils包内的一个软件，用来显示系统中已存在的环境变量,以及在定义的环境中执行指令。 tune2fs 允许系统管理员在Linux ext2、ext3或ext4文件系统上调整各种可调的文件系统参数。 ionice 获取或设置程序的IO调度与优先级。PRI(new)=PRI(default)+nice nice 调整程序运行的优先级，当前程序运行优先级基础之上调整指定值得到新的程序运行优先级。 renice 重新指定一个或多个进程的优先级 taskset 将某个进程与某个CPU核心绑定。 ulimit 为shell内建指令，可用来控制shell执行程序的资源 chcpu 修改cpu的状态,启用和关闭cpu，扫描新的CPU,改变底层虚拟机监控程序的CPU调度模式,并请求CPU的系统管理程序(配置)或返回CPU hypervisor numactl 用于控制进程与共享存储的 NUMA 技术机制。 sysctl 用于运行时配置内核参数,这些参数位于/proc/sys目录下。 ethtool 用于查询及设置网卡参数 stap (SystemTap) 内核开发者必须要掌握的一个工具,用于内核监控和跟踪，以及诊断性能或功能问题。 kpatch 给Linux内核动态打补丁但是不必重启系统 本文许可证本文遵循 CC BY-NC-SA 4.0（署名 - 非商业性使用 - 相同方式共享） 协议，转载请注明出处，不得用于商业目的。","link":"/2020/04/09/linux-%E6%80%A7%E8%83%BD%E5%88%86%E6%9E%90%EF%BC%8C%E6%B5%8B%E8%AF%95%E4%B8%8E%E8%B0%83%E4%BC%98%E5%B7%A5%E5%85%B7/"},{"title":"Linux系统目录结构","text":"/bin (binary)目录存放着最经常使用的命令 /boot这里存放的是启动Linux时使用的一些核心文件，包括一些连接文件以及镜像文件。 包括Linux内核文件，以及开机菜单与开机所需的配置文件 linux kernel常用的文件名为vmlinux /dev (device)该目录下存放的是Linux的外部设备，在Linux中访问设备的方式和访问文件的方式是相同的。 /etc (Editable Text Configuration)可配置文件存放所有的系统管理所需要的配置文件和子目录。 /etc/init.d所有服务的默认启动脚本都是放置在这个目录内 /etc/xinetd.d所谓的super daemon管理的各项服务的配置文件目录 /etc/X11与X Windows有关的各种配置文件都在这里 /etc/securetty只有/etc/securetty中登记的终端才允许root用户登录，如果不存在这个文件，则root可以在任何终端上登录 这个终端指tty1之类的 /etc/passwd保存的就是系统中所有的用户和用户的主要信息 /etc/shadow/etc/passwd是用户数据库，其中的域给出了用户名、加密口令和用户的其他信息. /etc/shadow是在安装了影子(shadow)口令软件的系统上的影子口令文件。影子口令文件将/etc/passwd 文件中的加密口令移动到/etc/shadow中，而后者只对超级用户root可读。这使破译口令更困难，以此增加系统的安全性。 /home (home directory)用户的主目录，在Linux中，每个用户都有一个自己的目录，一般该目录名是以用户的账号命名的 系统默认的用户主文件夹 比较重要的是 主文件夹有两者代号 ~ 代表目前这个用户的主文件夹 ~dmtsai 代表dmtsai的主文件夹 /lib这个目录里存放着系统最基本的动态连接共享库，其作用类似于Windows里的DLL文件。几乎所有的应用程序都需要用到这些共享库。 放置的是开机会用到的函数库，以及在/bin或/sbin下面的命令会调用的函数库而已 尤其重要的是/lib/modules/这个目录 放置内核相关的模块（驱动程序） /lost+found这个目录一般情况下是空的，当系统非法关机后，这里就存放了一些文件。 这个目录是使用标准的ext2/ext3文件系统格式才会产生的目录 /medialinux系统会自动识别一些设备，例如U盘、光驱等等，当识别后，linux会把识别的设备挂载到这个目录下。 包括软盘，光盘，DVD等设备都暂时挂载于此 /mnt系统提供该目录是为了让用户临时挂载别的文件系统的，或者说是额外的设备 比较早的时候，这个目录的用途与/media相同。只是有了/media之后这个目录就暂时用来挂载用了 /opt 这是给主机额外安装软件所摆放的目录。比如你安装一个ORACLE数据库则就可以放到这个目录下。默认是空的。 给第三方软件放置的目录 /proc (process)这个目录本身是一个虚拟的文件系统，放置的数据都是在内存中:例如，系统内核，进程，外部设备的状态及网络状态等 目录是一个虚拟的目录，它是系统内存的映射，我们可以通过直接访问这个目录来获取系统信息 这个目录的内容不在硬盘上而是在内存里，本身不占用任何硬盘空间，我们也可以直接修改里面的某些文件 /root该目录为系统管理员，也称作超级权限者的用户主目录。 /run是一个临时文件系统，存储系统启动以来的信息。当系统重启时，这个目录下的文件应该被删掉或清除。如果你的系统上有 /var/run 目录，应该让它指向 run。 /sbins就是Super User的意思，这里存放的是系统管理员使用的系统管理程序。 /selinux这个目录是Redhat/CentOS所特有的目录，Selinux是一个安全机制，类似于windows的防火墙，但是这套机制比较复杂，这个目录就是存放selinux相关的文件的。 这个目录的内容数据也是在内存中的信息，同样不会占用任何的硬盘容量 Secure Enhance Linux的执行目录 /srv (service) 该目录存放一些服务启动之后需要提取的数据。 一些网络服务启动之后，这些服务所取用的数据目录 存放服务启动后需要提取的数据（不用服务器就是空） /sys 这是linux2.6内核的一个很大的变化。该目录下安装了2.6内核中新出现的一个文件系统 sysfs 。 sysfs文件系统集成了下面3种文件系统的信息：针对进程信息的proc文件系统、针对设备的devfs文件系统以及针对伪终端的devpts文件系统。该文件系统是内核设备树的一个直观反映。 当一个内核对象被创建的时候，对应的文件和目录也在内核对象子系统中被创建。 这个目录与/proc目录类似，也是一个虚拟的文件系统，主要也是记录与内核相关的信息。包括目前已经加载的内核模块与内核检测到的硬件设备信息等。 这个目录同样不占用硬盘容量。 /tmp这个目录是用来存放一些临时文件的。 /usr (UNIX Software Resource,而不是user)是UNIX 操作系统软件资源所放置的目录，而不是用户的数据.这是一个非常重要的目录，用户的很多应用程序和文件都放在这个目录下，类似于windows下的program files目录。注意事项：FHS建议所有软件开发者将他们的数据合理地放置到这个目录下的子目录，而不要自行新建软件自己独立的目录有点像windows系统中C:\\Windows\\和C:\\Program files\\这两个目录的综合体 /usr/bin系统用户使用的应用程序。 /usr/sbin超级用户使用的比较高级的管理程序和系统守护程序 /usr/src内核源代码默认的放置目录。 /var这个目录中存放着在不断扩充着的东西，我们习惯将那些经常被修改的目录放在这个目录下。包括各种日志文件。 附注上面这些目录比较完备了 我主要是根据菜鸟教程，鸟哥的私房菜进行整理的 关于/run这个目录稍微特殊一点点，有的系统是二级目录，如果你的系统上有 /var/run 目录，应该让它指向 run。 可以用ls -l / 命令查看目录树 关于挂载开机过程中仅有根目录会被挂载，其他分区则是在开机完成之后才会持续进行挂载的行为 本文许可证本文遵循 CC BY-NC-SA 4.0（署名 - 非商业性使用 - 相同方式共享） 协议，转载请注明出处，不得用于商业目的。","link":"/2020/04/14/Linux%E7%B3%BB%E7%BB%9F%E7%9B%AE%E5%BD%95%E7%BB%93%E6%9E%84/"},{"title":"哈希表（散列表）详解","text":"基本概念散列方法（hashing）：一种将字符组成的字符串转换为固定长度（一般是更短长度）的数值或索引值的方法。以最基本的向量作为底层支撑结构，通过适当的散列函数在词条的关键码与向量单元的秩之间建立起映射关系。散列表（hashtable）：逻辑上由一些列可存放词条（或者其引用）的单元（称作桶（bucket）或桶单元）组成。各桶单元按照其逻辑次序在物理上连续排列。通常直接使用数组进行排列，这时散列表也称作桶数组（bucket array）地址空间（address space）：如果桶数组的容量为R，则其中合法秩的区间[0,r)也称作为地址空间。 散列函数（hash function）：用来描述散列方法，是从关键码空间到桶数组地址空间的函数。比如下面的hash()： 1hash() : key -&gt; hash(key) key的散列地址（hashing address）：也就是上面的hash(key) 。 完美散列（perfect hashing）：在时间和空间性能方面均达到最优的散列，也就是没有空余，没有重复的散列。 装填因子（load factor）：散列表中非空桶的数目与桶单元总数的比值。是散列表的空间利用率度量方法。 散列冲突（collision）：关键码不同的词条映射到同一个散列地址的情况。 词条的聚集（clustering）：词条集中到散列表内少数若干桶中（或附近）的现象。 综上散列表的基本构思概括为： 开辟物理地址连续的桶数组hba[],借助散列函数hash(),将词条关键码key映射为桶地址hash(key),从而快速确定待操作的词条的位置。 散列函数好的散列函数应该具备的条件： 确定性 ：也就是说词条E的映射地址hash(E.key)必须完全取决于E.key。 简单性 ：映射过程不能过于复杂 所有关键码经过映射后应该尽量覆盖整个地址空间。也就是说hash()最好是满射。 均匀性 ：最重要的原则，关键码映射到各个桶的概率是同等的，应该尽量为1/R ，R为散列表长度或容量。 直接定址法直接定址法：关键码就可以直接用作为散列地址 1hash(key)=key 除余法（devision method）除余法：选择一个适当的正整数R,用R去除关键码去除关键码,余数作为 散列地址.这个方法的关键是选取适当的R。一般R为素数，采用素数表长是是降低聚集发生概率的捷径。 1hash(key)=key mod R //R为散列表长度或容量。一般R为素数。 缺点：残留有某种连续性，比如相邻关键码所对应的散列的地址，总是彼此相邻。 MAD法（multiply-add-divide method）乘加除法乘加除法：需要依次执行乘法，加法，和除法运算得名。解决的问题：用来克服除余法的连续性缺陷。 12hash(key)=(a * key + b)mod R //a&gt;0，b&gt;0，且(a mod R) !=0//R为散列表长度或容量。一般R为素数。 数字分析法（selecting digits）数字分析法：从关键码key中特定进制的展开中抽出特定的若干位，构成一个整型地址。对关键码的各位进行分析（多种方法），丢下分布不均匀的位，留下均匀的位作为地址。数字分析法举例： 平方取中法（mid-square） 折叠法（folding） 一般折叠 往复折返式折叠 异或法（xor） 一般异或 往复折返式异或 伪随机数法越是随机，越是没有规律的就是好的散列函数。 1hash(key)=rand(key) mod R //R为散列表长度或容量。 冲突及其排解开散列策略/封闭定址开散列（open hashing）或封闭定址（closed addressing）： 开放基本的散列表结构，引入次级关联结构。 散列表中的地址只对特定的词条开放（每个桶可以只能能存放特定的一组词条）。 多槽位法（multiple slots）多槽位法：将每个桶细分为更小的称作槽位（slot）的若干单元，每一组槽位可以组织为向量或列表。//类似于二维数组 独立链法（separate chaining)（拉链法）拉链法：某些哈希地址可以被多个关键字值共享，这样可以针对每个哈希地址建立一个单链表。//引入链表先计算哈希地址，然后搜索该地址的单链表。 公共溢出区法（overflow）在原有散列表hashA之外再设置一个公共溢出区（散列表hashB），如果抽入词条发生冲突，就将该词条转存至公共溢出区（散列表hashB）中。 //引入新的散列表可以说是一种递归形式的散列表。 闭散列策略/开放定址闭散列（open hashing）或开放定址（closed addressing）： 仅仅依靠基本的散列表结构，就地排解冲突。 散列表中的地址对所有的词条开放（每个桶可以都有可能存放任一词条）。 一个桶冲突了，只允许在散列表内部为其寻找另一空桶。 线性试探法（linear probing）线性试探法：冲突发生时，顺序查看表中下一单元，直到找出一个空单元或查遍全表。被尝试的桶依次为： 1[(hash(key) + i)mod R ] ,i=1,2,3,... 平法试探法（二次探测法）被尝试的桶依次为： 1[(hash(key) + i^2)mod R ] ,i=1,2,3,... 伪随机试探法被尝试的桶依次为： 1[rand(i)mod R ] ,rand(i)为系统定义的第i个随机数。 再散列法（rehashing）再散列法：使用哈希函数去散列一个输入的时候，如果输出是同一个散列地址就再次散列，直至不发生冲突为止。缺点：每次冲突都要重新散列，计算时间增加。被尝试的桶依次为： 12//hash2为二级散列函数[(hash(key) + i*hash2(key) ] ,i=1,2,3,... 本文许可证本文遵循 CC BY-NC-SA 4.0（署名 - 非商业性使用 - 相同方式共享） 协议，转载请注明出处，不得用于商业目的。","link":"/2020/04/14/%E5%93%88%E5%B8%8C%E8%A1%A8%EF%BC%88%E6%95%A3%E5%88%97%E8%A1%A8%EF%BC%89%E8%AF%A6%E8%A7%A3/"},{"title":"《别闹了费曼先生》读书笔记","text":"当科学大师碰上菜鸟 报告时间终于到了。我面前坐了这些科学大师，全在等我开口讲话！我生平第一次学术报告，却碰上这样的听众！我的意思是说，他们会问很多难题，我将会大大地出丑了！我还清楚记得，从牛皮纸袋抽出讲稿时，双手不住地发抖。但奇迹出现了——事实上我很幸运，类似的奇迹在我一生中一再发生——只要我开始思考物理、必须全神贯注于要说明的问题上，我的脑袋中就再没有其他杂念，完全不会紧张。因此当我开始报告以后，我根本不知道听众是谁了；我只不过在说明这些物理概念。事情就那么简单！ 向数学家挑战 我向他们挑战：“我跟你们打赌，随便你提出一个定理——只要你用我听得懂的方式告诉我，它假设些什么、定理是什么等等——我立刻可以告诉你，它是对的还是错的！” 其实，我也并不是随便乱猜的。我有一套方法，甚至到了今天，当别人对我说明一些什么，而我努力要弄明白时，我还在用这些方法：不断地举实例。譬如说，那些念数学的提出一个听起来很了不得的定理，大家都非常兴奋。当他们告诉我这个定理的各项条件时，我便一边构思符合这些条件的情况。当他们说到数学上的“集”时，我便想到一个球，两个不相容的集便是两个球。然后视情况而定，球可能具有不同的颜色、长出头发或发生其他千奇百怪的状况。最后，当他们提出那宝贝定理时，我只要想到那跟我长满头发的绿球不吻合时，便宣布：“不对！” 看怎样用些有趣、近代的数学观念来教数学。原先的目的，是要使那些觉得数学枯燥无味的学生提高兴趣。 费曼教授 20 世纪40 年代，我待在普林斯顿的期间，亲眼看到高等研究院内那些卓越心灵的下场。他们都具备了聪明绝顶的头脑，因此特别被选中，来到坐落在森林旁边的漂亮房子里，整天悠哉游哉地闲坐——不用教书，没有任何约束或负担。但等过了一段日子，他们想不出什么新东西来，每个人心里一定开始感到内疚或沮丧，更加担心提不出新想法。可是一切还是如旧，仍然没有灵感。会发生这种情况，完全是因为那里缺乏真正的活动和挑战：他们没有跟做实验的学者接触，也不必思索如何回答学生提出的问题，什么都没有！ 在任何思考过程中，当一切进行顺利、灵感源源不绝时，教书确实是一种妨碍，十分讨厌。但有更多的时候是脑袋空空的，如果既想不出什么、又没做什么，那真会教人疯狂！你甚至不能说：“我在教书呀！”。 不敢面对问题到弄明白 在罗彻斯特举行了一个会议——一年一度的罗彻斯特研讨会（Rochester Conference）。我还是事事落于人后，而李政道已在发表关于宇称不守恒的论文。他和杨振宁作出宇称并不守恒的结论，现在他正提出解释这现象的理论。会议期间，我住在我位于西瑞桥斯（Syracuse）的妹妹家。我把论文带回家跟她说：“我搞不懂李政道和杨振宁说的东西，这全都那么复杂！”“不，”她说，“你的意思并不是说你无法弄懂它，而是你没有发明它。你没有用你的方法，从听到线索开始做起，把它推演出来。你应该做的是想象自己重新在当学生，把这篇论文带到楼上去，逐字逐句地读，检查每一条方程式。然后你就什么都弄懂了。”我接受了她的建议，把那东西从头看到尾，发现它真的很明显简单。我只是一直害怕去读它，总觉得它太深奥。","link":"/2020/04/18/%E3%80%8A%E5%88%AB%E9%97%B9%E4%BA%86%E8%B4%B9%E6%9B%BC%E5%85%88%E7%94%9F%E3%80%8B%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"教程","slug":"教程","link":"/tags/%E6%95%99%E7%A8%8B/"},{"name":"演讲","slug":"演讲","link":"/tags/%E6%BC%94%E8%AE%B2/"},{"name":"人生","slug":"人生","link":"/tags/%E4%BA%BA%E7%94%9F/"},{"name":"哲学","slug":"哲学","link":"/tags/%E5%93%B2%E5%AD%A6/"},{"name":"名著","slug":"名著","link":"/tags/%E5%90%8D%E8%91%97/"},{"name":"生产力","slug":"生产力","link":"/tags/%E7%94%9F%E4%BA%A7%E5%8A%9B/"},{"name":"插件","slug":"插件","link":"/tags/%E6%8F%92%E4%BB%B6/"},{"name":"chrome","slug":"chrome","link":"/tags/chrome/"},{"name":"学术论文","slug":"学术论文","link":"/tags/%E5%AD%A6%E6%9C%AF%E8%AE%BA%E6%96%87/"},{"name":"基本结构","slug":"基本结构","link":"/tags/%E5%9F%BA%E6%9C%AC%E7%BB%93%E6%9E%84/"},{"name":"练习","slug":"练习","link":"/tags/%E7%BB%83%E4%B9%A0/"},{"name":"心态","slug":"心态","link":"/tags/%E5%BF%83%E6%80%81/"},{"name":"Linux","slug":"Linux","link":"/tags/Linux/"},{"name":"工具","slug":"工具","link":"/tags/%E5%B7%A5%E5%85%B7/"},{"name":"性能分析","slug":"性能分析","link":"/tags/%E6%80%A7%E8%83%BD%E5%88%86%E6%9E%90/"},{"name":"目录结构","slug":"目录结构","link":"/tags/%E7%9B%AE%E5%BD%95%E7%BB%93%E6%9E%84/"},{"name":"散列表","slug":"散列表","link":"/tags/%E6%95%A3%E5%88%97%E8%A1%A8/"},{"name":"费曼","slug":"费曼","link":"/tags/%E8%B4%B9%E6%9B%BC/"},{"name":"诺贝尔奖","slug":"诺贝尔奖","link":"/tags/%E8%AF%BA%E8%B4%9D%E5%B0%94%E5%A5%96/"},{"name":"传记","slug":"传记","link":"/tags/%E4%BC%A0%E8%AE%B0/"}],"categories":[{"name":"博客维护","slug":"博客维护","link":"/categories/%E5%8D%9A%E5%AE%A2%E7%BB%B4%E6%8A%A4/"},{"name":"醒世通言","slug":"醒世通言","link":"/categories/%E9%86%92%E4%B8%96%E9%80%9A%E8%A8%80/"},{"name":"读书笔记","slug":"读书笔记","link":"/categories/%E8%AF%BB%E4%B9%A6%E7%AC%94%E8%AE%B0/"},{"name":"效率工具","slug":"效率工具","link":"/categories/%E6%95%88%E7%8E%87%E5%B7%A5%E5%85%B7/"},{"name":"学术论文","slug":"学术论文","link":"/categories/%E5%AD%A6%E6%9C%AF%E8%AE%BA%E6%96%87/"},{"name":"Linux","slug":"Linux","link":"/categories/Linux/"},{"name":"数据结构","slug":"数据结构","link":"/categories/%E6%95%B0%E6%8D%AE%E7%BB%93%E6%9E%84/"}]}